## Project 3
### Your assignment involves combining information from a number of SQL tables, then displaying the information in a pandas DataFrame
### Link within pd file was broken, file extracted from peer recommended link: https://github.com/lerocha/chinook-database/tree/master/ChinookDatabase/DataSources

In [254]:
import pandas as pd
import sqlite3

The dataset is large so determining how many tables there are is crucial. Below we will read the date and pull out all tables.

In [255]:
con = sqlite3.connect(r"C:\Users\HP\Downloads\Chinook_Sqlite.sqlite")
tables = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;", con)
tables

             name
0           Album
1          Artist
2        Customer
3        Employee
4           Genre
5         Invoice
6     InvoiceLine
7       MediaType
8        Playlist
9   PlaylistTrack
10          Track

This project only requires the display of the Customers’ Last
Name and First Name, and each customer’s purchased Track names and
Album Titles. We will need to pull from tables 0, 2, and 10.
Before continuing we will preview all three tables separately.

In [256]:
album = pd.read_sql_query("SELECT * FROM Album;", con)
album.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [257]:
customer = pd.read_sql_query("SELECT * FROM Customer;", con)
customer.head()

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
2,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,None,Ullevålsveien 14,Oslo,None,Norway,0171,+47 22 44 22 22,None,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

In [258]:
track = pd.read_sql_query("SELECT * FROM Track;", con)
track.head()

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,None,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

All the information found within the tables is not required for this project. We will pull out the required elements.
Starting with the customer table.

In [259]:
df_customer = customer[['CustomerId', 'LastName', 'FirstName']]
df_customer.head()
#Keeping customer id for easy identification and overall appearance of data.

   CustomerId     LastName  FirstName
0           1    Gonçalves       Luís
1           2       Köhler     Leonie
2           3     Tremblay   François
3           4       Hansen      Bjørn
4           5  Wichterlová  František

In [260]:
# For the track table it features a album id which identifies which album a song was featured on. We will keep that within the table.
df_track = track[['TrackId', 'Name', 'AlbumId']]
df_track.head()

   TrackId                                     Name  AlbumId
0        1  For Those About To Rock (We Salute You)        1
1        2                        Balls to the Wall        2
2        3                          Fast As a Shark        3
3        4                        Restless and Wild        3
4        5                     Princess of the Dawn        3

In [261]:
df_album = album[['AlbumId', 'Title']]
df_album.head()

   AlbumId                                  Title
0        1  For Those About To Rock We Salute You
1        2                      Balls to the Wall
2        3                      Restless and Wild
3        4                      Let There Be Rock
4        5                               Big Ones

To follow project requirements these three separate tables will be combined into one.

In [262]:
#Running into a error another table will need to be implemented as to be able to merge the tables with the customer table.
# The invoice table features the Customer ID found in the customer table. While Invoice Line has the Invoice id and track id found in the track table.
invoice = pd.read_sql_query("SELECT * FROM Invoice;", con)
invoice.head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86

In [263]:
invoice_line = pd.read_sql_query("SELECT * FROM InvoiceLine;", con)
invoice_line.head()

   InvoiceLineId  InvoiceId  TrackId  UnitPrice  Quantity
0              1          1        2       0.99         1
1              2          1        4       0.99         1
2              3          2        6       0.99         1
3              4          2        8       0.99         1
4              5          2       10       0.99         1

In [264]:
df_invoice = invoice[['CustomerId', 'InvoiceId']]

In [265]:
df_invoice_line = invoice_line[['InvoiceId', 'TrackId']]

Merging will now successfully work.

In [266]:
temp = pd.merge(df_customer, df_invoice)

In [267]:
temp2 = pd.merge (temp, df_invoice_line)

In [268]:
temp3 = pd.merge(temp2, df_track)

In [269]:
project = pd.merge(temp3, df_album)
project.head()

,CustomerId,LastName,FirstName,InvoiceId,TrackId,Name,AlbumId,Title
0,1,Gonçalves,Luís,98,3247,Experiment In Terra,253,"Battlestar Galactica (Classic), Season 1"
1,1,Gonçalves,Luís,98,3248,Take the Celestra,253,"Battlestar Galactica (Classic), Season 1"
2,28,Barnett,Julia,311,3226,"Battlestar Galactica, Pt. 1",253,"Battlestar Galactica (Classic), Season 1"
3,28,Barnett,Julia,311,3230,"Lost Planet of the Gods, Pt. 2",253,"Battlestar Galactica (Classic), Season 1"
4,28,Barnett,Julia,311,3234,"The Gun On Ice Planet Zero, Pt. 2",253,"Battlestar Galactica (Classic), Season 1"

Now we will clean and shape the data table by removing any columns not required for this project.

In [270]:
df_project = project[['LastName', 'FirstName', 'Name', 'Title']].sort_values(by=['LastName', 'FirstName'])
df_project.head(10) #preview table

    LastName FirstName                       Name                Title
52   Almeida   Roberto    Right Next Door to Hell  Use Your Illusion I
84   Almeida   Roberto               Mateus Enter       Afrociberdelia
85   Almeida   Roberto              Samba Do Lado       Afrociberdelia
87   Almeida   Roberto      Um Satélite Na Cabeça       Afrociberdelia
88   Almeida   Roberto              Amor De Muito       Afrociberdelia
102  Almeida   Roberto  Banditismo Por Uma Questa      Da Lama Ao Caos
103  Almeida   Roberto  Maracatu De Tiro Certeiro      Da Lama Ao Caos
166  Almeida   Roberto                  Vai Valer         Acústico MTV
938  Almeida   Roberto             Revolta Olodum               Olodum
941  Almeida   Roberto     Nossa Gente (Avisa Là)               Olodum

In [271]:
#Looks Great!
df_project = df_project.reset_index(drop=True)

Let's see the newly formatted table!

In [272]:
df_project

        LastName FirstName                     Name                    Title
0        Almeida   Roberto  Right Next Door to Hell      Use Your Illusion I
1        Almeida   Roberto             Mateus Enter           Afrociberdelia
2        Almeida   Roberto            Samba Do Lado           Afrociberdelia
3        Almeida   Roberto    Um Satélite Na Cabeça           Afrociberdelia
4        Almeida   Roberto            Amor De Muito           Afrociberdelia
...          ...       ...                      ...                      ...
2235  Zimmermann      Fynn                     Açai  Djavan Ao Vivo - Vol. 1
2236  Zimmermann      Fynn               Nem Um Dia  Djavan Ao Vivo - Vol. 1
2237  Zimmermann      Fynn              Flor De Lis  Djavan Ao Vivo - Vol. 1
2238  Zimmermann      Fynn                     Azul  Djavan Ao Vivo - Vol. 1
2239  Zimmermann      Fynn     Straight Out Of Line                 Faceless

[2240 rows x 4 columns]